raw18 <- read.csv("C:/Users/Administrator/Downloads/data/서류평가결과 비교(왜도 첨도 분산 히스토그램)/2018학년도 지원자+등급평균.csv",head=T)

sh18 <- raw18


sh18_b <- sh18[sh18$수학과학>=1 & sh18$수학과학<1.5,]
sh18_c <- sh18[sh18$수학과학>=1.5 & sh18$수학과학<2.0,]
sh18_d <- sh18[sh18$수학과학>=2.0 & sh18$수학과학<2.5,]
sh18_e <- sh18[sh18$수학과학>=2.5 & sh18$수학과학<3.0,]
sh18_f <- sh18[sh18$수학과학>=3.0 & sh18$수학과학<3.5,]
sh18_g <- sh18[sh18$수학과학>=3.5 & sh18$수학과학<4.0,]
sh18_h <- sh18[sh18$수학과학>=4.0 & sh18$수학과학<4.5,]
sh18_i <- sh18[sh18$수학과학>=4.5 & sh18$수학과학<5.0,]
sh18_j <- sh18[sh18$수학과학>=5.0 & sh18$수학과학<5.5,]
sh18_k <- sh18[sh18$수학과학>=5.5 & sh18$수학과학<6.0,]
sh18_l <- sh18[sh18$수학과학>=6.0 & sh18$수학과학<6.5,]
sh18_m <- sh18[sh18$수학과학>=6.5 & sh18$수학과학<7.0,]
sh18_n <- sh18[sh18$수학과학>=7.0 & sh18$수학과학<7.5,]
sh18_o <- sh18[sh18$수학과학>=7.5 & sh18$수학과학<8.0,]
sh18_p <- sh18[sh18$수학과학>=8.0 & sh18$수학과학<8.5,]
sh18_q <- sh18[sh18$수학과학>=8.5 & sh18$수학과학<9.0,]


t(rbind(
  summary(sh18_b$고교분류),
  summary(sh18_c$고교분류),
  summary(sh18_d$고교분류),
  summary(sh18_e$고교분류),
  summary(sh18_f$고교분류),
  summary(sh18_g$고교분류),
  summary(sh18_h$고교분류),
  summary(sh18_i$고교분류),
  summary(sh18_j$고교분류),
  summary(sh18_k$고교분류),
  summary(sh18_l$고교분류),
  summary(sh18_m$고교분류),
  summary(sh18_n$고교분류),
  summary(sh18_o$고교분류),
  summary(sh18_p$고교분류),
  summary(sh18_q$고교분류)))



raw <- read.csv("C:/Users/Administrator/Downloads/data/서류평가결과 비교(왜도 첨도 분산 히스토그램)/2014~2017 지원,합격,등록현황GPA(중점관리고교 ver).csv",head=T)

raw <- raw[raw$시기=="1. 수시",]
raw <- raw[raw$등록여부=="등록",]

sh <- raw[raw$고교유형=="1. 과학고",]

nh <- raw[raw$고교유형=="3. 일반고",]

yh <- raw[raw$고교유형=="2. 영재학교",]


sh_17<-sh[sh$학년도==2017,]

nh_17<-nh[nh$학년도==2017,]

yh_17<-yh[yh$학년도==2017,]


sh_17_b <- sh_17[sh_17$수과내신>=1 & sh_17$수과내신<1.5,]
sh_17_c <- sh_17[sh_17$수과내신>=1.5 & sh_17$수과내신<2.0,]
sh_17_d <- sh_17[sh_17$수과내신>=2.0 & sh_17$수과내신<2.5,]
sh_17_e <- sh_17[sh_17$수과내신>=2.5 & sh_17$수과내신<3.0,]
sh_17_f <- sh_17[sh_17$수과내신>=3.0 & sh_17$수과내신<3.5,]
sh_17_g <- sh_17[sh_17$수과내신>=3.5 & sh_17$수과내신<4.0,]
sh_17_h <- sh_17[sh_17$수과내신>=4.0 & sh_17$수과내신<4.5,]
sh_17_i <- sh_17[sh_17$수과내신>=4.5 & sh_17$수과내신<5.0,]
sh_17_j <- sh_17[sh_17$수과내신>=5.0 & sh_17$수과내신<5.5,]
sh_17_k <- sh_17[sh_17$수과내신>=5.5 & sh_17$수과내신<6.0,]
sh_17_l <- sh_17[sh_17$수과내신>=6.0 & sh_17$수과내신<6.5,]
sh_17_m <- sh_17[sh_17$수과내신>=6.5 & sh_17$수과내신<7.0,]
sh_17_n <- sh_17[sh_17$수과내신>=7.0 & sh_17$수과내신<7.5,]
sh_17_o <- sh_17[sh_17$수과내신>=7.5 & sh_17$수과내신<8.0,]
sh_17_p <- sh_17[sh_17$수과내신>=8.0 & sh_17$수과내신<8.5,]
sh_17_q <- sh_17[sh_17$수과내신>=8.5 & sh_17$수과내신<9.0,]



t(rbind(
  summary(sh_17_b$서류평가결과),
  summary(sh_17_c$서류평가결과),
  summary(sh_17_d$서류평가결과),
  summary(sh_17_e$서류평가결과),
  summary(sh_17_f$서류평가결과),
  summary(sh_17_g$서류평가결과),
  summary(sh_17_h$서류평가결과),
  summary(sh_17_i$서류평가결과),
  summary(sh_17_j$서류평가결과),
  summary(sh_17_k$서류평가결과),
  summary(sh_17_l$서류평가결과),
  summary(sh_17_m$서류평가결과),
  summary(sh_17_n$서류평가결과),
  summary(sh_17_o$서류평가결과),
  summary(sh_17_p$서류평가결과),
  summary(sh_17_q$서류평가결과)))




nh_17_b <- nh_17[nh_17$수과내신>=1 & nh_17$수과내신<1.5,]
nh_17_c <- nh_17[nh_17$수과내신>=1.5 & nh_17$수과내신<2.0,]
nh_17_d <- nh_17[nh_17$수과내신>=2.0 & nh_17$수과내신<2.5,]
nh_17_e <- nh_17[nh_17$수과내신>=2.5 & nh_17$수과내신<3.0,]
nh_17_f <- nh_17[nh_17$수과내신>=3.0 & nh_17$수과내신<3.5,]
nh_17_g <- nh_17[nh_17$수과내신>=3.5 & nh_17$수과내신<4.0,]
nh_17_h <- nh_17[nh_17$수과내신>=4.0 & nh_17$수과내신<4.5,]
nh_17_i <- nh_17[nh_17$수과내신>=4.5 & nh_17$수과내신<5.0,]
nh_17_j <- nh_17[nh_17$수과내신>=5.0 & nh_17$수과내신<5.5,]
nh_17_k <- nh_17[nh_17$수과내신>=5.5 & nh_17$수과내신<6.0,]
nh_17_l <- nh_17[nh_17$수과내신>=6.0 & nh_17$수과내신<6.5,]
nh_17_m <- nh_17[nh_17$수과내신>=6.5 & nh_17$수과내신<7.0,]
nh_17_n <- nh_17[nh_17$수과내신>=7.0 & nh_17$수과내신<7.5,]
nh_17_o <- nh_17[nh_17$수과내신>=7.5 & nh_17$수과내신<8.0,]
nh_17_p <- nh_17[nh_17$수과내신>=8.0 & nh_17$수과내신<8.5,]
nh_17_q <- nh_17[nh_17$수과내신>=8.5 & nh_17$수과내신<9.0,]



t(rbind(
  summary(nh_17_b$서류평가결과),
  summary(nh_17_c$서류평가결과),
  summary(nh_17_d$서류평가결과),
  summary(nh_17_e$서류평가결과),
  summary(nh_17_f$서류평가결과),
  summary(nh_17_g$서류평가결과),
  summary(nh_17_h$서류평가결과),
  summary(nh_17_i$서류평가결과),
  summary(nh_17_j$서류평가결과),
  summary(nh_17_k$서류평가결과),
  summary(nh_17_l$서류평가결과),
  summary(nh_17_m$서류평가결과),
  summary(nh_17_n$서류평가결과),
  summary(nh_17_o$서류평가결과),
  summary(nh_17_p$서류평가결과),
  summary(nh_17_q$서류평가결과)))


yh_17_b <- yh_17[yh_17$수과내신>=1 & yh_17$수과내신<1.5,]
yh_17_c <- yh_17[yh_17$수과내신>=1.5 & yh_17$수과내신<2.0,]
yh_17_d <- yh_17[yh_17$수과내신>=2.0 & yh_17$수과내신<2.5,]
yh_17_e <- yh_17[yh_17$수과내신>=2.5 & yh_17$수과내신<3.0,]
yh_17_f <- yh_17[yh_17$수과내신>=3.0 & yh_17$수과내신<3.5,]
yh_17_g <- yh_17[yh_17$수과내신>=3.5 & yh_17$수과내신<4.0,]
yh_17_h <- yh_17[yh_17$수과내신>=4.0 & yh_17$수과내신<4.5,]
yh_17_i <- yh_17[yh_17$수과내신>=4.5 & yh_17$수과내신<5.0,]
yh_17_j <- yh_17[yh_17$수과내신>=5.0 & yh_17$수과내신<5.5,]
yh_17_k <- yh_17[yh_17$수과내신>=5.5 & yh_17$수과내신<6.0,]
yh_17_l <- yh_17[yh_17$수과내신>=6.0 & yh_17$수과내신<6.5,]
yh_17_m <- yh_17[yh_17$수과내신>=6.5 & yh_17$수과내신<7.0,]
yh_17_n <- yh_17[yh_17$수과내신>=7.0 & yh_17$수과내신<7.5,]
yh_17_o <- yh_17[yh_17$수과내신>=7.5 & yh_17$수과내신<8.0,]
yh_17_p <- yh_17[yh_17$수과내신>=8.0 & yh_17$수과내신<8.5,]
yh_17_q <- yh_17[yh_17$수과내신>=8.5 & yh_17$수과내신<9.0,]



t(rbind(
  summary(yh_17_b$등록여부),
  summary(yh_17_c$등록여부),
  summary(yh_17_d$등록여부),
  summary(yh_17_e$등록여부),
  summary(yh_17_f$등록여부),
  summary(yh_17_g$등록여부),
  summary(yh_17_h$등록여부),
  summary(yh_17_i$등록여부),
  summary(yh_17_j$등록여부),
  summary(yh_17_k$등록여부),
  summary(yh_17_l$등록여부),
  summary(yh_17_m$등록여부),
  summary(yh_17_n$등록여부),
  summary(yh_17_o$등록여부),
  summary(yh_17_p$등록여부),
  summary(yh_17_q$등록여부)))